[
{"id": null, "name": "Shauna Morgan", "first_name": "Shauna", "last_name": "Morgan", "email": "Shauna_Morgan@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/shauna_morgan.jpg?h=736c3c7b&itok=UkMBrayf", "bio": "Shauna Morgan was elected to the 20th Northwest Territories Legislative Assembly to represent the constituency of Yellowknife North.\n\nMs. Morgan was born and raised in Barrie, Ontario. Having called Yellowknife home for the past 15 years, she has embraced the dynamic, creative and eclectic lifestyle in Old Town near Great Slave Lake.\n\nMs. Morgan’s commitment to public service is evident in her two consecutive terms on Yellowknife City Council from 2015 to 2022. During this time, she held pivotal roles, including Deputy Mayor, Chair of the Community Energy Planning Committee, and Chair of the Community Advisory Board on Homelessness.\n\nMs. Morgan holds degrees in International Development (B.A. Hons) and International Affairs (M.A.), specializing in community economic and political development in remote and Indigenous communities globally. She worked with a grassroots cross-cultural peacebuilding movement in the Philippines from 2002 to 2003. Her master's research delved into negotiations between mineral exploration companies and First Nations in Canada, focusing on land access during the earliest stages of mineral exploration.\n\nOver the past 15 years in Yellowknife, Ms. Morgan has prioritized work at the community level. Working with private consulting firms and a non-profit thinktank focused on clean energy, she served as a resource person to Indigenous governments and communities across the NWT. Her contributions ranged from planning renewable energy projects to housing initiatives, building cross-cultural environmental research and monitoring programs, and navigating the complexities of major resource extraction projects.\n\nMs. Morgan has drawn on her well-rounded skill set to diversify her professional pursuits. While serving as a City Councillor, she managed her own piano teaching studio, worked as an on-the-Land educator with Bushkids NWT, and contributed for many years as a full-time member of the Snow Castle construction crew and snow carving team. Additionally, she engaged in facilitation and consulting contracts.\n\nActive in the arts community, Ms. Morgan provides piano accompaniment for Yellowknife’s Aurora Chorealis (adult community choir) and Fireweed Children’s Choir. She served as a Board member for the Yellowknife Women’s Society and a weekly volunteer with Food Rescue and has dedicated time to the Yellowknife Ski Club and Victim Services.\n\nMs. Morgan’s love for the land is palpable in her adventurous spirit. She enjoys a myriad of outdoor activities in the North across all seasons, from whitewater and flatwater canoe trips to hiking in Auyuittuq National Park and along the Canol Trail. Her passion extends to cycle touring, cross-country skiing, mountain biking, and hunting for moose and ducks with her partner.", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/shauna-morgan", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Shane Thompson", "first_name": "Shane", "last_name": "Thompson", "email": "Shane_thompson@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/shane_thompson.jpg?h=c542b13e&itok=ZnAPyL-N", "bio": "Shane Thompson was re-elected to the 20th Northwest Territories Legislative Assembly after serving in the 18th and 19th Assemblies representing the constituency of Nahendeh. Mr. Thompson is the Honorable Speaker of the 20th Northwest Territories Legislative Assembly.\n\nMr. Thompson was first elected to the 18th Assembly in November 2015 and served as Chair of the Standing Committee on Social Development. Mr. Thompson was also a member of the Standing Committee on Priorities and Planning, the Standing Committee on Rules and Procedures, and the Striking Committee.\n\nMr. Thompson was born on July 11, 1963, in Hay River. He has lived in Kugluktuk (Coppermine), Inuvik, Hay River, and in Edmonton, while at the University of Alberta. Fort Simpson has been his home since 1992.\n\nMr. Thompson previously served two terms (three years each) as an elected official with the Fort Simpson District Education Authority, spending the last four years as the chairperson. Over the past 35 years, he has served on various community and territorial boards.\n\nMr. Thompson was employed as the Senior Sport and Recreation Coordinator with Municipal and Community Affairs (GNWT) in the Deh Cho region before being elected as a Member.\n\nMr. Thompson completed the Community Recreation Leaders Program at Arctic College in 1989 and is currently working on a Masters Certificate on Evaluation at the University of Victoria and Carleton University. He also completed three years towards an Education degree at the University of Alberta.\n\nMr. Thompson is an active volunteer with Northern Youth Aboard, CBET and Fundamental Movement, and HIGH FIVE®. As well, he is a past member of the Sport North Federation Board, NWT Softball and of NWTRPA, and the past president of Seven Spruce Golf Course.\n\nMr. Thompson is the father of seven children - five daughters and two sons – and has nine grandchildren.\n\nHe has been a Justice of the Peace since 1991.", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/shane-thompson", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Vince McKay", "first_name": "Vince", "last_name": "McKay", "email": "Vince_McKay@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/vince_mckay.jpg?h=73613b67&itok=jzrCnSL-", "bio": "Vince McKay was elected to the 20th Northwest Territories Legislative Assembly to represent the constituency of Hay River South. Mr. McKay was elected to the Executive Council of the 20th Assembly.\n\nMr. McKay was born on September 17, 1977, in the picturesque town of Hay River.\n\nWith a career spanning an impressive 26 years with the Government of the Northwest Territories (GNWT). Mr. McKay began his journey as a Corrections Officer, steadily climbing the ranks to become a trusted Corrections Supervisor. His leadership acumen led him to the esteemed position of Deputy Warden and eventually to the Directorship of the Investigations and Standards Office (ISO). In each role he demonstrated an unwavering commitment to justice, fairness, and the betterment of his community.\n\nMr. McKay’s dedication to the safety and well-being of Hay River residents extends to his 30-year tenure with the Hay River Fire Department. His legacy is further solidified by his ownership and operation of Westech Fire and Safety since 1999, showcasing his entrepreneurial spirit and commitment to the highest standards of safety.\n\nIn the realm of civic duty, Mr. McKay has been an integral part of the Hay River Town Council for an impressive 15 years. His tenure has been marked by a steadfast focus on community development, thoughtful governance, and a genuine concern for the welfare of his fellow citizens. His impact on the town council has left an indelible mark, earning him respect and admiration from colleagues and constituents alike.\n\nFamily lies at the heart of Mr. McKay’s life, with his wife, Barbara, and two children. Together, they form a united front that has weathered the challenges of a life devoted to public service.\n\nAway from the rigors of his professional life, Mr. McKay finds solace and joy in a myriad of hobbies. An avid sports enthusiast, he can be found on the ice, or navigating the fairways with a golf club in hand. His love for the great outdoors is evident in his passion for camping, fishing, boating, and playing softball—activities that provide a well-deserved respite from the demands of his roles.", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/vince-mckay", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Sheryl Yakeleya", "first_name": "Sheryl", "last_name": "Yakeleya", "email": "Sheryl_Yakeleya@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/sheryl_yakeleya.jpg?h=49d2da69&itok=W9Q63pxl", "bio": "Mrs. Yakeleya was elected to the 20th NWT Legislative Assembly to represent the constituency of Dehcho.\n\nMrs. Sheryl Brenda Yakeleya was born and raised in Fort Providence. NT. During her younger life, she lived on the land with her parents. Mrs. Yakeleya has also resided in Fort Simpson, Yellowknife, Norman Wells, and Tulita, NWT. She holds a Business Administration diploma and Office Administration certifcate from Aurora College, as well as a Training of Trainers certificate from the Nechi Institute.\n\nFor many years Mrs. Yakeleya has dedicated herself to serving community, by talking to people and working for them. She served as a Board Member for the Native Women’s Association and has volunteered with a variety of community social events. It was this active involvement that inspired the people of her community to encourage her to serve residents at the highest level as an elected politician.\n\nPrior to being elected Mrs. Yakeleya worked in the Indigenous Community Wellness Division in Yellowknife, a Contracts Administrator for the Norman Wells Housing Corporation and most recently as a Family Mentor Worker with the Zhahti Koe Friendship Centre, and Caretaker for the Seniors Home in Fort Providence. She also was employed as a Community Program Coordinator promoting community wellness and justice.\n\nIn her spare time, Mrs. Yakeleya loves to read, sew moose hair tufting, sing, clean, and organize.\n\nMrs. Yakeleya is married to Mr. Norman Yakeleya, former MLA for the Sahtu in the 15th, 16th, and 17th Assemblies, as well as former Dene National Chief. Together they have 6 children, 3 sons and 3 daughters, and 3 granddaughters.", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/sheryl-yakeleya", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Robert Hawkins", "first_name": "Robert", "last_name": "Hawkins", "email": "Robert_Hawkins@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/robert_hawkins.jpg?h=7774754f&itok=mIaMHFP6", "bio": "Information to come", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/robert-hawkins", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "R.J. Simpson", "first_name": "R.J.", "last_name": "Simpson", "email": "Rj_simpson@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/r.j._simpson.jpg?h=eb6658bb&itok=yWbCQf2Q", "bio": "R.J. Simpson was elected to the 20th Northwest Territories Legislative Assembly, representing the constituency of Hay River North. On December 7th, 2023, Mr. Simpson was elected Premier of the Northwest Territories.\n\nMr. Simpson was formerly acclaimed to the 19th Legislative Assembly and first elected into the 18th Assembly in 2015.\n\nMr. Simpson was Deputy Speaker of the 18th Assembly, Deputy Chair of the Standing Committee on Government Operations, and the Chair of the Special Committee on Transition Matters. Mr. Simpson was also a member of the Standing Committee on Priorities and Planning and the Standing Committee on Economic Development and Environment.\n\nMr. Simpson is a lifelong resident of Hay River After graduating from Diamond Jenness Secondary School in 1998 Mr. Simpson went on to obtain a Bachelor of Arts from MacEwan University and a law degree from the University of Alberta’s Faculty of Law.\n\nMr. Simpson has previously worked with the Government of Canada, Northern Transportation Company Ltd, Métis Nation Local 51, and Maskwa Engineering.\n\nWhile at law school, Mr. Simpson was the President of the Aboriginal Law Students’ Association. He has also served on the board of the Soaring Eagle Friendship Centre in Hay River and volunteered with the Canada-Ghana Education Project.", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "Hay River North", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/rj-simpson", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Lucy Kuptana", "first_name": "Lucy", "last_name": "Kuptana", "email": "Lucy_Kuptana@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/lucy_kaptana.jpg?h=f42b4a65&itok=bbh2WBrq", "bio": "Lucy Kuptana was elected to the 20th Legislative Assembly of the Northwest Territories in November 2023 to represent the constituency of Nunakput, which includes the communities of Paulatuk, Sachs Harbour, Tuktoyaktuk, and Ulukhaktok.\n\nPrior to her election, Mrs. Kuptana was the Senior Administrative Officer for the Hamlet of Tuktoyaktuk. She was also a director with the Tuktoyaktuk District Education Authority.\n\nFor 22 years previous, Mrs. Kuptana was the Director of Operations, Communications, and Culture with the Inuvialuit Regional Corporation (IRC). In a volunteer capacity, she has served as a director of the Inuvik Homeless Shelter Society, trustee of the Arctic Inspiration Prize, president of the Inuvialuit Communications Society, director of the Inuvialuit Investment Corporation, director of the Tuktoyaktuk and Inuvik Community Corporations, and a committee member for the 2023 Northern Youth Games “Inuvialuit Piuyausiat” in Tuktoyaktuk.\n\nOriginally from Aklavik and raised at her family’s bush camp in the Mackenzie Delta, Mrs. Kuptana obtained a Level II and Level III Certificate in Community Administration from Aurora College in the early 1990s and returned to graduate with a Diploma in Business Administration and Management in 2013. Mrs. Kuptana is currently enrolled with Yukon University, where she is working towards accreditation in the school’s First Nations Governance and Public Administration program.\n\nDespite a successful career spanning decades, Mrs. Kuptana credits her husband and family in supporting her. She says she owes much of her success to those who have fought – and continue to fight – for Indigenous and Inuvialuit rights.\n\nMrs. Kuptana’s guiding principle is to lead with respect, empathy, knowledge, and the willingness to work hard for the constituents she represents and all residents of the Northwest Territories.", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "Nunakput", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/lucy-kuptana", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Richard Edjericon", "first_name": "Richard", "last_name": "Edjericon", "email": "Richard_Edjericon@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/richard_edjericon_1.jpg?h=201e2d68&itok=k1rDwsGP", "bio": "Richard Edjericon was first elected to represent the district of Tu Nedhé-Wiilideh in by election during the 19th Assembly in 2022 and was re-elected to the 20th Assembly later the next year.\n\nA descendant of Treaty 8 Chipewyan signator Chief Oliver Edjericon, Richard Edjericon was born and raised in Little Buffalo River near Fort Resolution. He attended Diamond Jenness Secondary High School in Hay River and Akaitcho Hall in Yellowknife.\n\nObtaining his journeyman carpenter’s certification from Thebacha College in Fort Smith, Mr. Edjericon has nearly four decades of experience as a journeyman certified carpenter working through out the Northwest Territories and Nunavut in residential and commercial construction.\n\nEventually his work in construction brought him to the Northwest Territories Housing Corporation as the North Slave Maintenance Coordinator. He would also become the General Manager for the Yellowknives Dene First Nation Housing Division.\n\nMr. Edjericon’s dedication to his community led him to seek the position of Elected Head Chief for Dettah and the Yellowknives Dene First Nation, holding that office from 1999 to 2003. He also became the Acting Grand Chief Spokeperson on behalf of the Akaitcho Chiefs for the Akaitcho Territory Government. He later joined the Mackenzie Valley Environmental Impact Review Board in 2007 and soon became chair, reappointed to this position in 2011.\n\nMr. Edjericon’s proudest moments include settling boundary disputes, signing political accords, creating fairer nation to nation relationships, and fostering economic development. As MLA he brings with him a passion for a fairer, more prosperous North, and a great depth of knowledge in housing, economics, and politics. He lives in Ndilo with his wife, Aleida.”", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/richard-edjericon", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Lesa Semmler", "first_name": "Lesa", "last_name": "Semmler", "email": "Lesa_semmler@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/lesa_semmler.jpg?h=42cdef1b&itok=xA8Q7NnI", "bio": "Lesa Semmler currently serves as the Member representing Inuvik Twin Lakes in the 20th Northwest Territories Legislative Assembly, having been re-elected to the position. Born in Yellowknife, NT, and raised in Inuvik, where she still resides, Ms. Semmler has deep roots in the Northwest Territories.\n\nA Registered Nurse, Ms. Semmler graduated from the Aurora College Northern Nursing Program in 2000 and earned her Community Health Nurse Certification from the Canadian Nurses Association in 2008. With 15 years of frontline nursing experience at the Inuvik Regional Hospital, she focused on Acute Care, Homecare, and Public Health. Her career also included roles as the Manager of Acute Care Services and eventually the Regional Manager of Acute Care Services under the Northwest Territories Health and Social Services Authority. Notably, she served as the Inuvialuit Health System Navigator at the Inuvialuit Regional Corporation, assisting Inuvialuit Beneficiaries in navigating the healthcare system.\n\nBeyond her healthcare career, Ms. Semmler has actively contributed to education and community service. She served on the Inuvik District Education Authority, assuming the role of Chair from 2015 to 2018, and chaired the Beaufort Delta Education Council. Ms. Semmler participated in various working groups at the territorial and national levels, including the Inuit Tuberculosis Elimination Board and the Inuit Midwifery Revitalization. Her commitment to social justice is evident in her voluntary work as a member of the Missing and Murdered Indigenous Women and Girls National Family Advisory Circle, where she worked to ensure northern voices were heard and represented. Lesa Semmler's life and career reflect her passion for healthcare, education, and advocating for the well-being of her community.", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "Inuvik Twin Lakes", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/lesa-semmler", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Kate Reid", "first_name": "Kate", "last_name": "Reid", "email": "Kate_Reid@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/kate_reid.jpg?h=f194bbb9&itok=Mw9bzA_b", "bio": "Kate Reid was elected to the 20th Northwest Territories Legislative Assembly to represent the constituency of Great Slave.\n\nMs. Reid was born in Oshawa, Ontario in 1981, and has called Yellowknife home since 1989. She holds a bachelor’s degree in journalism (Toronto Metropolitan University, 2003), and a master’s degree in information studies (University of Toronto, 2009).\n\nAfter completing her master’s degree, she was grateful for the opportunity to work at the NWT Archives for nearly a decade, where she cultivated a deep appreciation for preserving and sharing the stories that define the territory and its government. Transitioning to the Department of Environment and Natural Resources in 2018, Ms. Reid focused on conservation and sustainable development issues in legislative and policy work prior to being elected.\n\nMs. Reid volunteered as President of YWCA NWT from 2021 to 2023 and served as UNW Local 40 President in 2019 and from 2021 to 2023. Her leadership extends to the cultural realm as a past director for Folk on the Rocks, Yellowknife’s long-running and beloved music festival. Ms. Reid has also contributed to community events such as NWT Pride and Yellowknife Pride, and the past springtime art spectacle, Burn on the Bay.\n\nIn her personal life, Ms. Reid is married and finds inspiration in an array of hobbies. She loves music, art, burlesque, drag, film, weightlifting, and travel.", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/kate-reid", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Kieron Testart", "first_name": "Kieron", "last_name": "Testart", "email": "Kieron_Testart@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/kieron_testart.jpg?h=34e4ec80&itok=f-uYk5Oh", "bio": "Kieron Testart was elected to the 20th Northwest Territories Legislative Assembly to represent the constituency of Range Lake.\n\nMr. Testart was born on March 22, 1985, in Victoria, British Columbia, Canada. He was raised in the Northwest Territories, first residing in Tuktoyaktuk and later in Yellowknife, where Mr. Testart now lives with his family, his diverse background and wealth of experiences have shaped his commitment to community development and effective governance.\n\nMr. Testart was elected as Member of the Legislative Assembly for Kam Lake in the 18th Legislative Assembly, where he demonstrated a keen understanding of the issues facing his constituents. Beyond his legislative roles, Kieron has contributed significantly to the economic development of the region. Serving as the Director of Economic Development for the Yellowknives Dene First Nation from 2021 to 2023. Mr. Testart’s commitment to education and language advocacy is evident in his role as Program Coordinator for Canadian Parents for French from 2020 to 2021. His efforts have extended to policy analysis within the Government of the Northwest Territories and serving as Deputy Sheriff from 2009 to 2014.\n\nAcademically, Kieron holds a Bachelor of Arts Degree in Political Science from the University of Lethbridge (2004-2009) and a Certificate in Parliamentary Governance from McGill University (2017).\n\nMarried to Colleen, he is the proud father of Corbin, Eve, and Leander. In addition to his professional pursuits, Kieron finds joy in various hobbies and interests, including a deep passion for Formula 1 and motorsport, a love for film and theatre, grassroots activism, and an avid curiosity about international affairs.\n\nKieron's commitment to community extends beyond the political realm. As a dedicated volunteer, he has been actively involved in various capacities, including serving on the NWT Federal Liberal Association Board of Directors since 2011, contributing to the Liberal Party of Canada. His volunteer experience also includes a position on the NWT Branch Board of Directors for Canadian Parents for French from 2014 to 2020 and mentoring youth with Big Brothers Big Sisters of Canada in 2014-2015.", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/kieron-testart", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Jay Macdonald", "first_name": "Jay", "last_name": "Macdonald", "email": "Jay_Macdonald@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/jay_macdonald.jpg?h=eb6658bb&itok=ReRS3pfy", "bio": "Jay Macdonald was elected to the 20th Northwest Territories Legislative Assembly to represent the constituency of Thebacha. Mr. Macdonald was elected to the Executive Council of the 20th Assembly.\n\nMr. Macdonald was born on June 26, 1964, in the town of Hay River, Northwest Territories. As an Indigenous Métis, Jay's roots run deep in the Northern Canadian landscape, and his journey has been marked by diverse experiences that have enriched both his personal and professional life.\n\nMr. Macdonald’s family relocated to Fort Smith in 1970. Mr. Macdonald successfully managed his small engine repair shop, providing essential services to the community and establishing himself as a reliable entrepreneur. Simultaneously, he delved into the intricacies of recreation facility management, overseeing operations at the local arena and golf course.\n\nIn his 13-year tenure as the Manager of Forest Management Services with the Environment and Conservation Division of the Government of the Northwest Territories, Mr. Macdonald demonstrated an unwavering commitment to environmental stewardship.\n\nMr. Macdonald’s dedication to youth development is evident in his 12-year role as the House Parent Program Coordinator for the Western Arctic Leadership Program. For five years, he served as a house parent, providing a nurturing environment for students from Lutsel Ke attending PWK High School. This experience not only showcased his compassion but also contributed significantly to the academic and personal growth of the students under his care.\n\nDrawing on his expertise as a Journey Person Small Equipment Technician, Mr. Macdonald spent 13 years managing a Polaris dealership and served as an Instructor for Small Equipment Maintenance, Aviation Fuel Management, and Logistics disciplines under the Incident Command System.\n\nMr. Macdonald’s commitment to community extends beyond his professional roles. As a dedicated volunteer, he served as President and Coach of Fort Smith Minor Hockey, nurturing young talent and instilling the values of teamwork and sportsmanship. His coaching prowess extended to the national stage as he led Team NWT at the National Aboriginal Hockey Championships.\n\nIn his role as a representative of the Fort Smith Métis Nation on the local District Education Association Board, Mr. Macdonald contributed to shaping educational policies that reflect the unique needs of the community. Additionally, he served as a Board Member and Chair of the Northwest Territories Apprenticeship and Occupational Certification Board, advocating for the recognition and advancement of skilled trades.\n\nMr. Macdonald’s commitment to community welfare is further evidenced by his involvement in various local activities and events. Whether coaching minor sports or contributing to volunteer initiatives, he has consistently worked towards creating a vibrant and cohesive community fabric.\n\nOutside of his professional and community engagements, Mr. Macdonald has a full family life. He is married to Karen, is a proud father to three children, and a doting grandfather to three grandchildren.\n\nIn his leisure time, Jay indulges in hobbies that reflect his love for the outdoors. Golfing, fishing, gardening, and enjoying the vast Northern landscapes are among his favorite pastimes.", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/jay-macdonald", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Julian Morse", "first_name": "Julian", "last_name": "Morse", "email": "Julian_morse@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/julian_morse.jpg?h=73613b67&itok=la8DF6uZ", "bio": "Mr. Morse was elected to the 20th Northwest Territories Legislative Assembly to represent the constituency of Frame Lake.\n\nMr. Morse grew up in Yellowknife and graduated from Sir John Franklin High School. He studied political science and economics in undergrad, has a diploma in environment and natural resources technology from Aurora College, and a master’s degree in conflict analysis & management from Royal Roads University.\n\nMr. Morse has a diverse professional background, including ten years’ experience working in the NWT’s regulatory system. He has worked as an environmental technician, policy analyst, executive director of an NGO, and constituency assistant at the Legislative Assembly. He has also worked a variety of trades and labour positions over the years, including a season working on the Snowking’s snow castle construction team. He is licensed to operate commercial watercraft, and worked as a zodiac driver and polar bear guard for an expedition cruise company in the summer.\n\nHis dedication to public service extended to a two-term tenure as a city councillor in Yellowknife, where he worked from 2015 to 2022. He served on the board of directors for the Yellowknife Housing Authority from 2021 to 2023.\n\nIn his spare time Julian enjoys various outdoor activities, and has extensively explored Great Slave Lake in his sailboat. He is an avid hunter, and has participated in expeditions for moose, caribou, and muskox across the varied landscapes of the Northwest Territories.\n\nPrior to his political career, he contributed to the Boards of Folk on the Rocks and the Somba K'e Paddling Club.", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/julian-morse", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Jane Weyallon Armstrong", "first_name": "Jane Weyallon", "last_name": "Armstrong", "email": "Jane_WeyallonArmstrong@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/jane_weyallon_armstrong.jpg?h=0757b86f&itok=KL6kgucV", "bio": "Jane Weyallon Armstrong was elected to the 20th Assembly to represent the constituency of Monfwi. Ms. Armstrong was elected to the 19th Assembly during a by-election to represent the constituency of Monfwi.\n\nMs. Weyallon Armstrong was born in Fort Rae, Northwest Territories. Currently residing in Behchoko, Northwest Territories, her impactful journey has left a lasting mark on her community.Having served as President of the Native Women’s Association from 2019 to 2021, Ms. Weyallon Armstrong collaborated with board members on the National Inquiry into missing and murdered Indigenous women and girls final report. Her commitment to the cause has been a driving force in addressing crucial issues.Ms. Weyallon Armstrong’s extensive involvement in community governance includes roles such as a Community Government of Behchoko Councillor (2009–2013, 2017–2021, June 2021 to July 2021) and Tlicho Government Assembly Member (Consensus Government) from 2009 to 2013. Additionally, she contributed by being on the Mackenzie Valley Impact Review Board from 2020 to 2021.With a career spanning over 25 years at the Dogrib Divisional Board of Education (now Tlicho Community Services Agency), Ms. Weyallon Armstrong’s impact reached the lives of high school students from various communities. Her roles as Residence Manager and later as Coordinator, Community Liaison, and Student Transition Support Services showcased her dedication to education and community development.Ms. Weyallon Armstrong’s educational journey includes graduating from Sir John Franklin Territorial High School in Yellowknife, where she resided at Akaitcho Hall. She earned a Bachelor of Arts with a Major in Politics and a Minor in Native Studies from the University of Saskatchewan. In 1994, she obtained her Social Work Diploma from Aurora College, Thebacha Campus, and in 1992, she earned her Child and Youth Care Worker Diploma from Mount Royal College.Ms. Weyallon Armstrong, in partnership with her spouse, have raised their daughter, and now revel in the role of proud grandparents to a grandson. Ms. Weyallon Armstrong possesses a range of interests that extend to sewing, reading, and engaging in various cultural activities. Her longstanding commitment to volunteering for fundraising events and field trips underscores her dedication to community well-being.", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/jane-weyallon-armstrong", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Denny Rodgers", "first_name": "Denny", "last_name": "Rodgers", "email": "Denny_Rodgers@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/denny_rodgers_0.jpg?h=5a878202&itok=saHoVT0B", "bio": "Denny Rodgers was elected to the 20th Northwest Territories Legislative Assembly to represent the constituency of Inuvik Boot Lake.\n\nMr. Rodger’s was born on August 4, 1968, in Come by Chance, Newfoundland. Mr. Rodger’s has been a cornerstone of Inuvik since 1994. With eight years on the Inuvik Town Council and three as Mayor, his commitment to community is unwavering.Mr. Rodger’s academic foundation from Eastern College covers Business, Banking, Marketing, and Financial Accounting. His professional journey spans diverse roles, including three years at the Town of Inuvik, twelve years with Inuvialuit Development Corporation, ten years at the Inuvik Housing Authority, and two self-employed years.Beyond his civic and professional pursuits, Mr. Rodger finds joy in family life, with wife Joanne and three children. His summers involve boating and golf, while winter sees him on snowmobiles and curling rinks. Traveling, a passion whenever time allows complements his busy schedule.Over the last three decades, Mr. Rodger’s has actively engaged in philanthropic pursuits. He has served as the Chair of the Workers' Safety and Compensation Commission Governance Board, helmed the Business Development and Investment Corporation, and assumed the role of Public Administrator for Aurora College. His dedication extends to various organizations, including minor hockey, Children’s First, curling, softball, and Arctic Expo. Through these diverse commitments, he consistently demonstrates a profound commitment to making a positive impact on the lives of those around him.", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/denny-rodgers", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "George Nerysoo", "first_name": "George", "last_name": "Nerysoo", "email": "George_Nerysoo@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/george_nerysoo.jpg?h=a02a05ab&itok=G0-wEiJO", "bio": "George Nerysoo was first elected as a Member for Mackenzie Delta in September 2023 for the 20th Legislative Assembly. Mr. Nerysoo was born in Fort McPherson and returned to his hometown after living in Inuvik and Aklavik for almost 20 years.\n\nMr. Nerysoo attended Samuel Hearne Secondary School in Inuvik and completed studies in business administration at Aurora College.\n\nMr. Nerysoo is an active community member, always keen to volunteer and participate in community events, especially sporting events. Mr. Nerysoo is also active at the regional level, being chosen several times as the Fort McPherson delegate for the Gwich’in Tribal Council Assembly.\n\nPrior to be elected, Mr. Nerysoo held the position of Deputy Mayor with the Hamlet of Fort McPherson. He has also been employed as the Acting Band Manager with the Tetlit Gwich’in Band Council, and prior to this worked several years on the Louis Cardinal Ferry.\n\nIn his spare time, Mr. Nerysoo enjoys staying physically active by walking as well as exercising with other community members. He also enjoys quality time with his two children and granddaughter.\n\nMackenzie Delta Electoral District", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/george-nerysoo", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Daniel McNeely", "first_name": "Daniel", "last_name": "McNeely", "email": "Daniel_McNeely@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/danny_mcneely.jpg?h=4f6c5c4d&itok=EgJlbIf_", "bio": "Biography\n\nInformation to come", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/daniel-mcneely", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Caroline Wawzonek", "first_name": "Caroline", "last_name": "Wawzonek", "email": "Caroline_wawzonek@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/caroline_wawzonek.jpg?h=3fd839f3&itok=6tsm929B", "bio": "Caroline Wawzonek was first elected to the 19th Legislative Assembly in 2019 as the Member for Yellowknife South. Ms. Wawzonek served as Minister of Justice, Minister of Finance, Minister responsible for the Status of Women and the Minister of Industry, Tourism and Investment. In 2023, Ms. Wawzonek was acclaimed to the 20th Legislative Assembly and returned to Executive Council as Deputy Premier, Minister of Finance, Minister of Infrastructure and the Minister Responsible for the NWT Power Corporation. Ms. Wawzonek holds a Bachelor of Arts from the University of Calgary (2000) and a law degree from the University of Toronto, Faculty of Law (2005). Her academic journey included language studies in China and Taiwan, as well as legal internships in the Philippines and England. Born in Calgary, AB, she has called Yellowknife home since 2007. After establishing her criminal law practice post-admission to the Law Society of the NWT, Ms. Wawzonek appeared in all levels of NWT courts and engaged in circuit court travel. She later joined Dragon Toner, expanding her practice to general litigation and administrative law until becoming a member of the 19th Assembly. Since 2007, she has taken on leadership roles in the legal community, including the presidency of the Law Society of the Northwest Territories (LSNT), section chair for the Canadian Bar Association Northwest Territories Branch (CBA-NT), and committee membership in various working groups. Her community involvement extends to appointments in multiple Yellowknife organizations, and she received a national award in 2017 for her contributions to Canadian Women in Law. Ms. Wawzonek, a mother of two, enjoys running, paddleboarding, and time outdoors. Yellowknife South Electoral District\n\nCaroline Wawzonek was first elected to the 19th Legislative Assembly in 2019 as the Member for Yellowknife South. Ms. Wawzonek served as Minister of Justice, Minister of Finance, Minister responsible for the Status of Women and the Minister of Industry, Tourism and Investment. In 2023, Ms. Wawzonek was acclaimed to the 20th Legislative Assembly and returned to Executive Council as Deputy Premier, Minister of Finance, Minister of Infrastructure and the Minister Responsible for the NWT Power Corporation.\n\nMs. Wawzonek holds a Bachelor of Arts from the University of Calgary (2000) and a law degree from the University of Toronto, Faculty of Law (2005). Her academic journey included language studies in China and Taiwan, as well as legal internships in the Philippines and England. Born in Calgary, AB, she has called Yellowknife home since 2007.\n\nAfter establishing her criminal law practice post-admission to the Law Society of the NWT, Ms. Wawzonek appeared in all levels of NWT courts and engaged in circuit court travel. She later joined Dragon Toner, expanding her practice to general litigation and administrative law until becoming a member of the 19th Assembly.\n\nSince 2007, she has taken on leadership roles in the legal community, including the presidency of the Law Society of the Northwest Territories (LSNT), section chair for the Canadian Bar Association Northwest Territories Branch (CBA-NT), and committee membership in various working groups. Her community involvement extends to appointments in multiple Yellowknife organizations, and she received a national award in 2017 for her contributions to Canadian Women in Law.\n\nMs. Wawzonek, a mother of two, enjoys running, paddleboarding, and time outdoors.\n\nYellowknife South Electoral District", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "Yellowknife South", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/caroline-wawzonek", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"},
{"id": null, "name": "Caitlin Cleveland", "first_name": "Caitlin", "last_name": "Cleveland", "email": "Caitlin_Cleveland@ntassembly.ca", "photo_url": "https://www.ntlegislativeassembly.ca/sites/default/files/styles/3_4_portrait_profile/public/legacy/caitlin_cleveland.jpg?h=388d53a1&itok=0QTc4caH", "bio": "The Honourable Caitlin Cleveland was first elected in the 19th Assembly as the MLA for Kam Lake in 2019, and has served as the Minister of Education, Culture and Employment, and Minister of Industry, Tourism and Investment since 2023 after being acclaimed to the 20th Assembly.\n\nIn addition to owning and operating a northern business for over 20 years, Minister Cleveland worked in a variety of communications and policy roles in both the public and private sectors before entering politics.\n\nBetween 2019 to 2023, she chaired the Standing Committee on Social Development, fulfilling a goal to be a part of the discussions and decisions affecting social programs in the Northwest Territories. Her noteworthy work on the Committee included guiding the considerable review and input into recommendations on housing in the NWT, suicide prevention, and improvements to caring for children in care and building supported families.\n\nWithin the scope of her portfolios, Minister Cleveland is focused on helping children grow into successful NWT residents that recognize opportunities and develop successful careers that contribute to a growing economy. She advocates for new approaches to sector diversification and innovation, and ensures the North is welcoming both skilled foreign workers and investment in the critical mineral resources across the territory. She persistently explores solutions for efficient and equitable access to programs and services, upholding a shared vision of an NWT where people are supported in the ways they wish to live, work, and grow.\n\nMinister Cleveland is a lifelong resident of Yellowknife where she lives with her husband and their three children.", "twitter": "", "linkedin": "", "instagram": "", "facebook": "", "youtube": "", "tiktok": "", "fun_facts": "", "gallery": "", "party_name": "", "gov_level": "territorial", "province": "Northwest Territories", "organization": "Legislative Assembly of the Northwest Territories", "district_name": "", "boundary": "", "offices": [], "personal_url": "", "role_url": "https://www.ntlegislativeassembly.ca/meet-members/mla/caitlin-cleveland", "quick_links": [], "election_id": "", "reason_to_run": "", "message_to_constituent": "", "policy_priorities": "", "gender_pronouns": "", "group_email": "", "update_date": "2026-02-04"}
]